EDT/УТ/src/Reports/ГрафикВодителей/ГрафикВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ГрафикВодителей</name>
</mdclass:Report>

EDT/УТ/src/InformationRegisters/новаДоступностьТранспорта/новаДоступностьТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаДоступностьТранспорта</name>
  <resources>
    <name>КодПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>DocumentRef.новаПланированиеРаботыТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Гараж</name>
    <type>
      <types>CatalogRef.новаГаражи</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаКалендарьВозможныхРейсов/новаКалендарьВозможныхРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаКалендарьВозможныхРейсов</name>
  <resources>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НачалоРейса</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.новаДоговоры</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.новаКонтактныеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <type>
      <types>CatalogRef.новаНаправления</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаПеревозчика</name>
    <type>
      <types>DocumentRef.новаЗаявкаПеревозчика</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ТелефонныеАппаратыТранспорта/ТелефонныеАппаратыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелефонныеАппаратыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Reports/ГрафикВодителей/ObjectModule.bsl
Функция Сформировать(Таб, ДатаНач, ДатаКон) Экспорт
	Таб.Очистить();
	
	Зап = Новый Запрос;
	//Зап.Текст = "ВЫБРАТЬ
	//            |	новаКалендарьВозможныхРейсов.Транспорт,
	//            |	новаКалендарьВозможныхРейсов.Водитель,
	//            |	новаКалендарьВозможныхРейсов.Транспорт.НомерЛог КАК Индекс,
	//            |	ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Наименование КАК Телефон,
	//            |	новаКалендарьВозможныхРейсов.Экспедитор
	//            |ИЗ
	//            |	РегистрСведений.новаКалендарьВозможныхРейсов КАК новаКалендарьВозможныхРейсов
	//            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних КАК ТелефонныеАппаратыТранспортаСрезПоследних
	//            |		ПО новаКалендарьВозможныхРейсов.Транспорт.Ссылка = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт.Ссылка
	//            |ГДЕ
	//            |	новаКалендарьВозможныхРейсов.НачалоПериода >= &НачДата
	//            |	И новаКалендарьВозможныхРейсов.КонецПериода <= &КонДата
	//            |
	//            |УПОРЯДОЧИТЬ ПО
	//            |	Индекс";
	Зап.Текст = "ВЫБРАТЬ
	            |	ВыборкаФлагаДоступности.Транспорт КАК Транспорт,
	            |	ЕСТЬNULL(ВозможныеРейсы.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) КАК Водитель,
	            |	ЕСТЬNULL(ВозможныеРейсы.Экспедитор, ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)) КАК Экспедитор,
	            |	ЕСТЬNULL(ВозможныеРейсы.НачалоПериода, &НачалоРейсаПоДефолту) КАК НачалоПериода,
	            |	ВозможныеРейсы.Транспорт.НомерЛог КАК Индекс,
	            |	ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Наименование КАК Телефон
	            |ИЗ
	            |	(ВЫБРАТЬ
	            |		ДоступностьТранспорта.Транспорт КАК Транспорт,
	            |		МАКСИМУМ(ДоступностьТранспорта.НачалоПериода) КАК НачалоПериода
	            |	ИЗ
	            |		РегистрСведений.новаДоступностьТранспорта КАК ДоступностьТранспорта
	            |	ГДЕ
	            |		ДоступностьТранспорта.НачалоПериода <= &ДатаРедактирования
	            |	
	            |	СГРУППИРОВАТЬ ПО
	            |		ДоступностьТранспорта.Транспорт) КАК ВыборкаФлагаДоступности
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаДоступностьТранспорта КАК ДоступностьТранспорта
	            |		ПО ВыборкаФлагаДоступности.Транспорт = ДоступностьТранспорта.Транспорт
	            |			И ВыборкаФлагаДоступности.НачалоПериода = ДоступностьТранспорта.НачалоПериода
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.новаКалендарьВозможныхРейсов КАК ВозможныеРейсы
	            |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних КАК ТелефонныеАппаратыТранспортаСрезПоследних
	            |			ПО ВозможныеРейсы.Транспорт.Ссылка = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт.Ссылка
	            |		ПО (ВозможныеРейсы.Транспорт = ВыборкаФлагаДоступности.Транспорт)
	            |			И (ВозможныеРейсы.НачалоПериода >= &ДатаРедактирования)
	            |			И (ВозможныеРейсы.КонецПериода <= КОНЕЦПЕРИОДА(&ДатаРедактирования, ДЕНЬ))
	            |ГДЕ
	            |	ДоступностьТранспорта.Доступен
	            |	И ЕСТЬNULL(ВозможныеРейсы.Водитель, ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Индекс";	
				
	Зап.УстановитьПараметр("ДатаРедактирования", НачалоДня(ДатаНач));
	Зап.УстановитьПараметр("НачалоРейсаПоДефолту", НачалоДня(ДатаНач) + 7 * 60 * 60);
				
	//Зап.УстановитьПараметр("НачДата", НачалоДня(ДатаНач));			
	//Зап.УстановитьПараметр("КонДата", КонецДня(ДатаКон));			
	
	Рез = Зап.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	ОблШ1 = Мак.ПолучитьОбласть("Шапка1");
	ОблШ2 = Мак.ПолучитьОбласть("Шапка2");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	ОблСтрД = Мак.ПолучитьОбласть("СтрокаДежурный");
	
	
	ОблШ1.Параметры.Название = "График водителей на " + Формат(ДатаНач, "ДЛФ=D");
	Таб.Вывести(ОблШ1);
	
	ОблСтрД.Параметры.ИмяЛогиста = ПараметрыСеанса.ТекущийПользователь;
	
	Таб.Вывести(ОблСтрД);
	Таб.Вывести(ОблШ2);

	
	НПП = 1;
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.Параметры, Тек);
		ОблСтр.Параметры.НПП = НПП;
		Таб.Вывести(ОблСтр);
		НПП = НПП + 1;
	КонецЦикла;
	
	Возврат Таб;
КонецФункции
